# GetAllCapsStatus Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormattedText..::..GetAllCapsStatus Method
FormattedText Class See Also
---
Returns whether All, None or a Mixed of characters in the entire text are in all caps.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public FormatStatus GetAllCapsStatus()
```

Visual Basic
---
```text
Public Function GetAllCapsStatus As FormatStatus
```

Visual C++
---
```text
public:
FormatStatus GetAllCapsStatus()
```

# ### Return Value
The format status of all caps on characters FormatStatus.
# Remarks
This function only returns All or None if the entire text contains one character.
# See Also
FormattedText Class
GetAllCapsStatus Overload
Autodesk.Revit.DB Namespace